
// Глава 1: Роль алгоритмов в вычислениях
//
// Ответы на вопросы:
// 1.1.1: Сортировка выборки из БД по дате/времени или по алфавиту. 
// 1.1.2: Потребление памяти
// 1.1.3: Односвязный список - неэффективное получение элемента по индексу
// 1.1.4: ХЗ
// 1.1.5: Задачи с приближенным решением: МКЭ, обратная задача кинематики
//        Задачи с точным решением: ХЗ
//
// 1.2.1: Любое приложение с сортировками, любое игровое приложение
//        с расчетами колизий объектов
// 1.2.2: Нужно просто приравнять две сложности 
//        и решить уравенние относительно N. Получим N = 6.507
// 1.2.3: Аналогично предыдущему: N=14.325
//
// Задача на сравнение времени работы алгоритмов:
//
//          | Секунда | Минута  | Час     | День    | Месяц   | Год     | Век     
// ---------+---------+---------+---------+---------+---------+---------+----------
//  lg(n)   | ?       |
// ---------+---------+---------+---------+---------+---------+---------+----------
//  sqrt(n) | 1kkkk   |
// ---------+---------+---------+---------+---------+---------+---------+----------
//  n       | 1000000 |
// ---------+---------+---------+---------+---------+---------+---------+----------
//  n lg(n) | ~62746  |
// ---------+---------+---------+---------+---------+---------+---------+----------
//  n^2     | 1000    |
// ---------+---------+---------+---------+---------+---------+---------+----------
//  n^3     | 100     |
// ---------+---------+---------+---------+---------+---------+---------+----------
//  2^n     | ~19.93  |
// ---------+---------+---------+---------+---------+---------+---------+----------
//  n!      | 9       |
// ---------+---------+---------+---------+---------+---------+---------+----------

